{"0":{"author":"Andreas M. Antonopoulos","category":"Security","code":"1491954388","content":"Book Description:\n\nJoin the technological revolution that’s taking the world of finance by storm. Mastering Bitcoin is your guide through the seemingly complex world of bitcoin, providing the knowledge you need to participate in the internet of money. Whether you’re building the next killer app, investing in a startup, or simply curious about the technology, this revised and expanded second edition provides essential detail to get you started.\nBitcoin, the first successful decentralized digital currency, is still in its early stages and yet it’s already spawned a multi-billion dollar global economy. This economy is open to anyone with the knowledge and passion to participate. Mastering Bitcoin provides the knowledge. You simply supply the passion.\nThe second edition includes:\n\nA broad introduction to bitcoin–ideal for non-technical users, investors, and business executives\nAn explanation of the technical foundations of bitcoin and cryptographic currencies for developers, engineers, and software and systems architects\nDetails of the bitcoin decentralized network, peer-to-peer architecture, transaction lifecycle, and security principles\nNew developments such as Segregated Witness, Payment Channels, and Lightning Network\nImproved explanations of keys, addresses and wallets\nUser stories, analogies, examples, and code snippets illustrating key technical concepts\n","download_links":"http://file.allitebooks.com/20170829/Mastering%20Bitcoin,%202nd%20Edition.pdf","file_format":"PDF","file_size":"11.5 MB","language":"English","pages":"408","read_online":"http://www.allitebooks.com/read/index.php?id=28038","year":"2017"},"1":{"author":"Eben Upton","category":"Hardware & DIY","code":"111846446X","content":"Book Description:\n\nMake the most out of the world’s first truly compact computer\n\nIt’s the size of a credit card, it can be charged like a smartphone, it runs on open-source Linux, and it holds the promise of bringing programming and playing to millions at low cost. And now you can learn how to use this amazing computer from its co-creator, Eben Upton, in Raspberry Pi User Guide. Cowritten with Gareth Halfacree, this guide gets you up and running on Raspberry Pi, whether you’re an educator, hacker, hobbyist, or kid. Learn how to connect your Pi to other hardware, install software, write basic programs, and set it up to run robots, multimedia centers, and more.\n\nGets you up and running on Raspberry Pi, a high-tech computer the size of a credit card\nHelps educators teach students how to program\nCovers connecting Raspberry Pi to other hardware, such as monitors and keyboards, how to install software, and how to configure Raspberry Pi\nShows you how to set up Raspberry Pi as a simple productivity computer, write basic programs in Python, connect to servos and sensors, and drive a robot or multimedia center\nAdults, kids, and devoted hardware hackers, now that you’ve got a Raspberry Pi, get the very most out of it with Raspberry Pi User Guide.\n\n","download_links":"http://file.allitebooks.com/20170830/Raspberry%20Pi%20User%20Guide.pdf","file_format":"PDF","file_size":"27.5 MB","language":"English","pages":"262","read_online":"http://www.allitebooks.com/read/index.php?id=28041","year":"2012"},"2":{"author":"Christine Bresnahan","category":"Linux","code":"1119150795","content":"Book Description:\n\nFull coverage of the latest LPI-level 2 exams, with bonus online test bank\n\nLPIC-2 is the one-stop preparation resource for the Linux Professional Institute’s Advanced Level certification exam. With 100 percent coverage of all exam objectives, this book provides clear and concise coverage of the Linux administration topics you’ll need to know for exams 201 and 202. Practical examples highlight the real-world applications of important concepts, and together, the author team provides insights based on almost fifty years in the IT industry. This brand new second edition has been completely revamped to align with the latest versions of the exams, with authoritative coverage of the Linux kernel, system startup, advanced storage, network configuration, system maintenance, web services, security, troubleshooting, and more. You also get access to online learning tools including electronic flashcards, chapter tests, practice exams, and a glossary of critical terms to help you solidify your understanding of upper-level Linux administration topics.\n\nThe LPI-level 2 certification confirms your advanced Linux skill set, and the demand for qualified professionals continues to grow. This book gives you the conceptual guidance and hands-on practice you need to pass the exam with flying colors.\n\nUnderstand all of the material for both LPIC-2 exams\nGain insight into real-world applications\nTest your knowledge with chapter tests and practice exams\nAccess online study aids for more thorough preparation\nOrganizations are flocking to the open-source Linux as an excellent, low-cost, secure alternative to expensive operating systems like Microsoft Windows. As the Linux market share continues to climb, organizations are scrambling to find network and server administrators with expert Linux knowledge and highly practical skills. The LPI-level 2 certification makes you the professional they need, and LPIC-2 is your ideal guide to getting there.\n\n","download_links":"http://file.allitebooks.com/20170829/PIC-2%20Linux%20Professional%20Institute%20Certification%20Study%20Guide,%202nd%20Edition.pdf","file_format":"PDF","file_size":"14.8 MB","language":"English","pages":"768","read_online":"http://www.allitebooks.com/read/index.php?id=28035","year":"2016"},"3":{"author":"Adam Gordon","category":"Network Security","code":"1119278635","content":"Book Description:\n\nThe fourth edition of the Official (ISC)2® Guide to the SSCP CBK® is a comprehensive resource providing an in-depth look at the seven domains of the SSCP Common Body of Knowledge (CBK).  This latest edition provides an updated, detailed guide that is considered one of the best tools for candidates striving to become an SSCP.\n\nThe book offers step-by-step guidance through each of SSCP’s domains, including best practices and techniques used by the world’s most experienced practitioners. Endorsed by (ISC)² and compiled and reviewed by SSCPs and subject matter experts, this book brings together a global, thorough perspective to not only prepare for the SSCP exam, but it also provides a reference that will serve you well into your career.\n\n","download_links":"http://file.allitebooks.com/20170828/The%20Official%20(ISC)2%20Guide%20to%20the%20SSCP%20CBK,%204th%20Edition.pdf","file_format":"PDF","file_size":"86.2 MB","language":"English","pages":"928","read_online":"http://www.allitebooks.com/read/index.php?id=28032","year":"2016"},"4":{"author":"Antonio Lopez","category":"PHP","code":"1785880543","content":"Book Description:\n\nPHP is a great language for building web applications. It is essentially a server-side scripting language that is also used for general purpose programming. PHP 7 is the latest version with a host of new features, and it provides major backwards-compatibility breaks.\n\nThis book begins with the fundamentals of PHP programming by covering the basic concepts such as variables, functions, class, and objects. You will set up PHP server on your machine and learn to read and write procedural PHP code. After getting an understanding of OOP as a paradigm, you will execute MySQL queries on your database. Moving on, you will find out how to use MVC to create applications from scratch and add tests. Then, you will build REST APIs and perform behavioral tests on your applications.\n\nBy the end of the book, you will have the skills required to read and write files, debug, test, and work with MySQL.\n\nWhat you will learn\n\nSet up a server on your machine with PHP\nUse PHP syntax with the built-in server to create apps\nApply the OOP paradigm to PHP to write richer code\nUse MySQL to manage data in your web applications\nCreate a web application from scratch using MVC\nAdd tests to your web application and write testable code\nUse an existing PHP framework to build and manage your applications\nBuild REST APIs for your PHP applications\nTest the behavior of web applications with Behat\n","download_links":"http://file.allitebooks.com/20170827/Learning%20PHP%207.pdf","file_format":"PDF","file_size":"5.8 MB","language":"English","pages":"414","read_online":"http://www.allitebooks.com/read/index.php?id=28029","year":"2016"},"5":{"author":"Bryan WC Chung","category":"Programming","code":"1484227743","content":"Book Description:\n\nApply the Processing language to tasks involved in computer vision–tasks such as edge and corner detection, recognition of motion between frames in a video, recognition of objects, matching of feature points and shapes in different frames for tracking purposes, and more. You will manipulate images through creative effects, geometric transformation, blending of multiple images, and so forth. Examples are provided.\nPro Processing for Images and Computer Vision with OpenCV is a step-by-step training tool that guides you through a series of worked examples in linear order. Each chapter begins with a basic demonstration, including the code to recreate it on your own system. Then comes a creative challenge by which to engage and develop mastery of the chapter’s topic. The book also includes hints and tips relating to visual arts, interaction design, and industrial best practices.\nThis book is intended for any developer of artistic and otherwise visual applications, such as in augmented reality and digital effects, with a need to manipulate images, and to recognize and manipulate objects within those images. The book is specifically targeted at those making use of the Processing language that is common in artistic fields, and to Java programmers because of Processing’s easy integration into the Java programming environment.\nWhat You’ll Learn\nMake use of OpenCV, the open source library for computer vision in the Processing environment\nCapture live video streams and examine them frame-by-frame for objects in motion\nRecognize shapes and objects through techniques of detecting lines, edges, corners, and more\nTransform images by scaling, translating, rotating, and additionally through various distortion effects\nApply techniques such as background subtraction to isolate motion of objects in live video streams\nDetect and track human faces and other objects by matching feature points in different images or video frames\nWho This Book Is For\nMedia artists, designers, and creative coders\n","download_links":"http://file.allitebooks.com/20170827/Pro%20Processing%20for%20Images%20and%20Computer%20Vision%20with%20OpenCV.pdf","file_format":"PDF","file_size":"11.6 MB","language":"English","pages":"292","read_online":"http://www.allitebooks.com/read/index.php?id=28026","year":"2017"},"6":{"author":"Nathan Haines","category":"Operating Systems","code":"1484229991","content":"Book Description:\n\nDiscover how to get the most out of Ubuntu for work, home, and play.  Learning a new operating system can feel daunting, especially if you’re used to Windows or OS X. If you’ve been afraid to try Ubuntu because you don’t know where to start, this book introduces you to a wide selection of software and settings that will make your computer ready to work for you.\n\nYou’ll see how Ubuntu can make your computing life easy. In addition to a tour of Ubuntu’s modern and easy-to-use interface, you’ll also learn how Ubuntu’s Software Updater keeps all of your software secure and up-to-date. Browsing the Internet becomes faster and safer. Creating documents and sharing with others is built right in. Enjoying your music and movie libraries helps you unwind.\nUbuntu is the world’s third most popular operating system and powers desktop and laptop computers, servers, private and public clouds, and embedded devices. There’s never been a better time to install Ubuntu and move to an open source way of life. Completely updated for this exciting second edition, Beginning Ubuntu for Windows and Mac Users will help you start your journey into Free and Open Source Software with Ubuntu 16.04 LTS.\nWhat You’ll Learn\nUnderstand the advantages of Ubuntu and its variants―Kubuntu, Xubuntu, and more\nInstall Ubuntu on its own or alongside your computer’s existing operating system\nSearch Ubuntu’s catalog of thousands of applications―all ready to install with a single click\nWork with files and disks that were created with Windows and OS X\nRun simple, interesting tasks and games using the command line\nCustomize Ubuntu in powerful ways and get work done with virtual machines\nWho This Book Is For\nAnyone who wants to move to using an open source operating system.\n\n","download_links":"http://file.allitebooks.com/20170826/Beginning%20Ubuntu%20for%20Windows%20and%20Mac%20Users,%202nd%20Edition.pdf","file_format":"PDF","file_size":"11.9 MB","language":"English","pages":"196","read_online":"http://www.allitebooks.com/read/index.php?id=28022","year":"2017"},"7":{"author":"Pradeep Macharla","category":"Programming","code":"1484227956","content":"Book Description:\n\nMaster continuous integration, deployment and automated testing for Android apps. You’ll see how to set up and tear down sandbox environments to test the end-user experience, where you’ll learn how to manage a mobile device in addition to the build machine. Android Continuous Integration applies a real-world CI pattern that has been thoroughly tested and implemented.\nThis book starts with continuous integration concepts and the tools and code needed to become proficient in continuous integration for Android apps. You’ll also follow acceptance test driven development (ATDD) best practice, giving you all the skills you need to become a better, more effective developer. Finally, you’ll learn about the Appium mobile automation library and the Jenkins continuous integration tool.\nWhat You Will Learn\nUnderstand how to build an Android mobile app from source\nSet up a development or debuggi\nng environment for mobile apps\n\nIntegrate with the Nexus dependency management and application release tool\nWork with the SonarQube code quality analyzer\nUse debugging tools in Android\nWho This Book Is For\nProduct owners/business analysts, QA/test engineers, developers and build/deploy engineers.\n","download_links":"http://file.allitebooks.com/20170826/Android%20Continuous%20Integration.pdf","file_format":"PDF","file_size":"7.8 MB","language":"English","pages":"141","read_online":"http://www.allitebooks.com/read/index.php?id=28017","year":"2017"},"8":{"author":"Joshua Cook","category":"Data Processing","code":"1484230116","content":"Book Description:\n\nLearn Docker “infrastructure as code” technology to define a system for performing standard but non-trivial data tasks on medium- to large-scale data sets, using Jupyter as the master controller.\nIt is not uncommon for a real-world data set to fail to be easily managed. The set may not fit well into access memory or may require prohibitively long processing. These are significant challenges to skilled software engineers and they can render the standard Jupyter system unusable.\nAs a solution to this problem, Docker for Data Science proposes using Docker. You will learn how to use existing pre-compiled public images created by the major open-source technologies―Python, Jupyter, Postgres―as well as using the Dockerfile to extend these images to suit your specific purposes. The Docker-Compose technology is examined and you will learn how it can be used to build a linked system with Python churning data behind the scenes and Jupyter managing these background tasks. Best practices in using existing images are explored as well as developing your own images to deploy state-of-the-art machine learning and optimization algorithms.\nWhat  You’ll Learn\nMaster interactive development using the Jupyter platform\nRun and build Docker containers from scratch and from publicly available open-source images\nWrite infrastructure as code using the docker-compose tool and its docker-compose.yml file type\nDeploy a multi-service data science application across a cloud-based system\nWho This Book Is For\nData scientists, machine learning engineers, artificial intelligence researchers, Kagglers, and software developers\n","download_links":"http://file.allitebooks.com/20170825/Docker%20for%20Data%20Science.pdf","file_format":"PDF","file_size":"7.1 MB","language":"English","pages":"257","read_online":"http://www.allitebooks.com/read/index.php?id=28012","year":"2017"},"9":{"author":"Mark McDonnell","category":"Programming","code":"1484229517","content":"Book Description:\n\nGet up to speed with Clojure in this quick and practical primer. You’ll learn the nuts and bolts of functional programming, data structures, sequences, destructuring, pattern matching, polymorphism, concurrency, conventions, and more. Author Mark McDonnell talks about organization with namespaces; how to change the language via macros; object-oriented programming; and creating command-line apps. Finally, he shows you how to write Clojure from shell languages and interfaces such as Vim.\nAfter reading and using Quick Clojure, you’ll come away with first-hand knowledge and advice on how to quickly adopt, use, and apply Clojure without all the theoretical baggage that bigger books can sometimes bring.\nWhat You’ll Learn\nWork with data structures and their syntax\nDiscover OOP in Clojure with patterns, polymorphisms, pattern matching, and concurrency\nUse conventions, organization, and namespaces in Clojure\nCreate command-line apps\nBuild various Clojure projects with the Leiningen IDE tool and framework\nWho This Book Is For\nProgrammers with experience.  A Java background would be helpful, but not required.\n","download_links":"http://file.allitebooks.com/20170825/Quick%20Clojure.pdf","file_format":"PDF","file_size":"2.3 MB","language":"English","pages":"200","read_online":"http://www.allitebooks.com/read/index.php?id=28008","year":"2017"}}