{"0":{"author":"Todd Tomlinson","category":"CMS","code":"1484202546","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Successfully architect a Drupal 8 website that scales to meet project requirements of any size and scope.</div>\n<div></div>\n<div>Starting with a one-chapter review of Drupal basics, you’ll dive into deeper topics including software development processes, architecting a Drupal site, scaling Drupal, working effectively with themes, and more. In addition to a thorough discussion of custom module development and how to develop modules as building blocks, you’ll also review many common ways of integrating Drupal with other 3rd party systems.</div>\n<div></div>\n<p>Building and maintaining an enterprise-ready Drupal website presents a unique set of challenges and complexities. From development processes and content management to deployments, version control and more, all aspects of Drupal development are impacted when two or more developers are on a project. If you are involved in a Drupal project that requires frequent updates and long-term support from a team of developers, system administrators, and end-users, Enterprise Drupal 8 Development is for you.</p>\n<p>Whether you’re an experienced Drupal developer looking to expand your skills, a systems administrator managing a Drupal project, or a PHP developer new to Drupal, Enterprise Drupal 8 Development will give you the knowledge and inspiration you need to manage large and complex projects.</p>\n<p>What You’ll Learn</p>\n<ul>\n<li>Architect Drupal for development teams and apply best practices for large Drupal projects</li>\n<li>Integrate 3rd party applications with Drupal</li>\n<li>Manage content, code, and configuration across multiple staging environments</li>\n<li>Build a consistent user experience for administrators and content creators</li>\n</ul>\n<div></div>\n<p>Who This Book Is For</p>\n<p>The primary audience is intermediate to advanced Drupal developers who are working on large-scale Drupal projects and advanced PHP developers new to Drupal</p>\n<p>The secondary audience is IT Professionals such as Systems Administrators managing Drupal projects</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170523/Enterprise%20Drupal%208%20Development.pdf","file_format":"PDF","file_size":"9.1 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/05/Enterprise-Drupal-8-Development.jpg","language":"English","name":"Enterprise Drupal 8 Development","pages":"309","read_online":"http://www.allitebooks.com/read/index.php?id=27491","year":"2017"},"1":{"author":"Jennifer Hodgdon","category":"PHP CMS","code":"1491911468","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>If you’re a web programmer, your experiences have taught you certain lessons—and only some of them apply well to Drupal. Drupal has its own set of programming principles that require a different approach, and many programmers make mistakes when relying on skills they’ve used for other projects. This book will show you which programming techniques you can use—and which you should avoid—when building web applications with this popular content management framework.</p>\n<p>Updated to cover both Drupal 7 and Drupal 8, the guidelines in this book demonstrate which programming practices conform to the “Drupal way” and which don’t. The book also serves as an excellent guide for Drupal 7 programmers looking to make the transition to Drupal 8.</p>\n<ul>\n<li>Get an overview of Drupal, including Drupal core and add-on modules and themes</li>\n<li>Learn Drupal’s basic programming principles, such as the ability to customize behavior and output with hooks</li>\n<li>Compare Drupal 7 and Drupal 8 programming methods, APIs, and concepts</li>\n<li>Discover common Drupal programming mistakes—and why hacking is one of them</li>\n<li>Explore specific areas where you can put your programming skills to work</li>\n<li>Learn about the new object-oriented Drupal 8 API, including plugins and services</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170320/Programmer's%20Guide%20to%20Drupal,%202nd%20Edition.pdf","file_format":"PDF","file_size":"2.1 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/03/Programmers-Guide-to-Drupal-2nd-Edition.jpg","language":"English","name":"Programmer’s Guide to Drupal, 2nd Edition","pages":"238","read_online":"http://www.allitebooks.com/read/index.php?id=26991","year":"2015"},"2":{"author":"Viktor Khliupko","category":"CMS","code":"1484224566","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>\n<div>Learn how Magento 1 works and how to manage it via&nbsp;easy and advanced techniques.&nbsp;Magento continues to be a top choice for eCommerce solutions in small and large businesses, and many systems are still running on Magento 1.x. This book is specifically designed for these versions.<p></p>\n</div>\n<div></div>\n<div>Aimed at entrepreneurs, marketers, and other experts interested in eCommerce,&nbsp;Magento 1 DIY&nbsp;shows you how to set up and configure Magento 1 for your own project.<p></p>\n</div>\n<div></div>\n<p>You will also learn how to use extensions, templates and enterprise features guided by&nbsp;easy-to-understand, real-world examples.</p>\n</div>\n<div></div>\n<div>What You Will Learn:<p></p>\n</div>\n<div>\n<ul>\n<li>Set up, configure, use templates, designs and extensions</li>\n<li>Optimize security and performance</li>\n<li>Integrate with PIM, ERP, CRM, and other enterprise systems</li>\n</ul>\n</div>\n<div>Who This Book Is For:<p></p>\n</div>\n<div>\n<div>Anyone who wants to learn the basics of all aspects of Magento. You do not need any previous experience with Magento.</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20161218/Magento%201%20DIY.pdf","file_format":"PDF","file_size":"5.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/2016/12/Magento-1-DIY.jpg","language":"English","name":"Magento 1 DIY","pages":"240","read_online":"http://www.allitebooks.com/read/index.php?id=25732","year":"2017"},"3":{"author":"Tracy Smith","category":"CMS","code":"1849511128","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>In today’s global society, online collaboration has gained tremendous importance as businesses look for ways to share ideas and collaborate easily. Open Atrium is a powerful and flexible Drupal installation that provides intranet solutions to businesses and organizations for sharing ideas. It is used to create intranets where co-workers or teams can collaborate easily. But Open Atrium is filled with so many powerful features that you may need some help to use it to its full potential. Open Atrium is also a viable alternative to SharePoint.</div>\n<div>Drupal Intranets with Open Atrium unlocks the power of Open Atrium and guides you through real-world examples of an Open Atrium intranet. Examples and screenshots are used throughout the book so that you can follow along on your Open Atrium installation. The examples walk through setting up your site, user administration, implementing core features, and maintaining your intranet site.<p></p>\n</div>\n<div>This book starts off with explaining how to set up a web server on a Windows or Mac computer and install Drupal with the Open Atrium distribution. After installing Open Atrium you will learn how to add and maintain users. The book also covers some exciting topics such as the different “spaces” or “workgroup” micro-sites that can be created to match your organization’s structure. Reading each of these sections, you will understand and become familiar with managing the Open Atrium interface. Once you comprehend the Open Atrium interface, you will learn how to create a blog, document library, and issue tracker for each group’s dashboard or site page. The book covers everything from editing a single piece of content to arranging the layout of that content on each page.<p></p>\n</div>\n<div>By the end of this book, you should be able to establish your own intranet site for your organization or workgroup using the Open Atrium Drupal distribution.A how-to guide with examples and screenshots to guide you through every step of creating an intranet with Open Atrium.<p></p>\n</div>\n<div></div>\n<div>What you will learn from this book<p></p>\n<ul>\n<li>Add all the major features of an intranet to your site with Open Atrium</li>\n<li>Get to grips with Open Atrium’s interface and its features</li>\n<li>Install Open Atrium and customize it for your organization or company</li>\n<li>Create sub-sites (spaces) for each of your teams, departments, or workgroups</li>\n<li>Manage users and create a member directory</li>\n<li>Add core features packaged with Open Atrium such as Blog, Calendar, and Issue Tracker</li>\n<li>Extend the functionality of Open Atrium by adding pluggable features developed by the Drupal Open Source community</li>\n<li>Maintain your intranet by performing routine maintenance tasks</li>\n<li>Analyze your site’s logs and reports to ensure that it is running in tip-top condition</li>\n</ul>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20161215/Drupal%20Intranets%20with%20Open%20Atrium.pdf","file_format":"PDF","file_size":"15.6 MB","img":"http://www.allitebooks.com/wp-content/uploads/2016/12/Drupal-Intranets-with-Open-Atrium-400x494.jpg","language":"English","name":"Drupal Intranets with Open Atrium","pages":"304","read_online":"http://www.allitebooks.com/read/index.php?id=25639","year":"2011"},"4":{"author":"Vladimir Prelovac","category":"CMS","code":"1847193595","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>If you can write WordPress plug-ins, you can make WordPress do just about anything. From making the site easier to administer, to adding the odd tweak or new feature, to completely changing the way your blog works, plug-ins are the method WordPress offers to customize and extend its functionality. This book will show you how to build all sorts of WordPress plug-ins: admin plug-ins, Widgets, plug-ins that alter your post output, present custom “views” of your blog, and more.</p>\n<p>WordPress Plug-in Development (Beginner’s Guide) focuses on teaching you all aspects of modern WordPress development. The book uses real and published WordPress plug-ins and follows their creation from the idea to the finishing touches, in a series of carefully picked, easy-to-follow tutorials. You will discover how to use the WordPress API in all typical situations, from displaying output on the site in the beginning to turning WordPress into a CMS in the last chapter. In Chapters 2 to 7 you will develop six concrete plug-ins and conquer all aspects of WordPress development.</p>\n<p>Each new chapter and each new plug-in introduces different features of WordPress and how to put them to good use, allowing you to gradually advance your knowledge. This book is written as a guide to take your WordPress skills from the very beginning to the level where you are able to completely understand how WordPress works and how you can use it to your advantage.</p>\n<p>What you will learn from this book?</p>\n<ul>\n<li>Get to know the WordPress code base, WordPress’s plug-in architecture, and the plug-in application programming interface (API) and learn how to hack it</li>\n<li>Master the WordPress database and the API – access and manipulate data, handle user roles and permissions, posts, and so on</li>\n<li>Hook into the rest of WordPress using actions and filters</li>\n<li>Change the way your WordPress backend looks by customizing menus, submenus, and the plug-in admin panel</li>\n<li>Integrate AJAX and jQuery into your plug-ins to dynamically generate content</li>\n<li>Hook directly to WordPress edit pages and use AJAX to generate fast searches</li>\n<li>Integrate your plug-in with WordPress panels and the tinyMCE editor</li>\n<li>Access and work with third-party APIs like Flickr</li>\n<li>Implement localization support for users of other languages</li>\n<li>Maintain and manage your plug-in using SVN and publish it to the WordPress Plugin Repository</li>\n<li>Handle security issues and make your plug-ins safer to use</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20161110/WordPress%20Plugin%20Development.pdf","file_format":"PDF","file_size":"5.7 MB","img":"http://www.allitebooks.com/wp-content/uploads/2016/11/WordPress-Plugin-Development-Beginners-Guide.jpg","language":"English","name":"WordPress Plugin Development, Beginner’s Guide","pages":"296","read_online":"http://www.allitebooks.com/read/index.php?id=24893","year":"2009"},"5":{"author":"Rakhitha Nimesh Ratnayake","category":"CMS","code":"1782174397","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>WordPress is one of the most rapidly expanding markets on the Web. Learning how to build complex and scalable web applications will give you the ability and knowledge to step into the future of WordPress.</p>\n<p>This book is a practical, scenario-based guide to expanding the power of the WordPress core modules to develop modular and maintainable real-world applications from scratch. This book will consistently emphasize adapting WordPress features into web applications. It will walk you through the advanced usages of existing features such as access controlling, database handling, custom post types, pluggable plugins, routing, translation, caching, and many more while you build the backend of a portfolio management application.</p>\n<p>After reading this book, you will have the ability to develop powerful web applications rapidly within limited time frames.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Develop extendable plugins with the use of WordPress features in core modules</li>\n<li>Develop pluggable modules to extend the core features of WordPress as independent modules</li>\n<li>Follow WordPress coding standards to develop reusable and maintainable code</li>\n<li>Build and customize themes beyond conventional web layouts</li>\n<li>Explore the power of core database tables and understand the limitations when designing database tables for large applications</li>\n<li>Integrate open source modules into WordPress applications to keep up with the latest open source technologies</li>\n<li>Customize the WordPress admin section and themes to create the look and feel of a typical web application</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20161103/WordPress%20Web%20Application%20Development,%20Second%20Edition.pdf","file_format":"PDF","file_size":"5.1 MB","img":"http://www.allitebooks.com/wp-content/uploads/2016/11/WordPress-Web-Application-Development-Second-Edition-400x494.jpg","language":"English","name":"WordPress Web Application Development, Second Edition","pages":"430","read_online":"http://www.allitebooks.com/read/index.php?id=24768","year":"2016"},"6":{"author":"Matt Glaman","category":"CMS","code":"1785881477","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Began as a message board, Drupal today is open source software maintained and developed by a community of over 1,000,000 users and developers. Drupal is used by numerous local businesses to global corporations and diverse organizations all across the globe. With Drupal 8’s recent release and the exciting features it brings, this book will be your go-to guide to experimenting with all of these features through helpful recipes.</p>\n<p>We’ll start by showing you how to customize and configure the Drupal environment as per your requirements, as well as how to install third-party libraries and then use them in the Drupal environment. Then we will move on to creating blocks and custom modules with the help of libraries. We will show you to use the latest mobile-first feature of Drupal 8, which will help you make your apps responsive across all the major platforms. This book will also show you how to incorporate multilingual facilities in your sites, use web services and third-party plugins with your applications from inside Drupal 8, and test and deploy your apps</p>\n<p>What you will learn</p>\n<ul>\n<li>Extend Drupal through contributed or custom modules and themes</li>\n<li>Develop an internationalized website with Drupal’s multilingual tools</li>\n<li>Integrate third-party front-end and back-end libraries with Drupal</li>\n<li>Turn Drupal into a web services provider using REST</li>\n<li>Create a mobile-first responsive Drupal application</li>\n<li>Run SimpleTest and PHPUnit to test Drupal</li>\n<li>Understand the plugin system that powers many of Drupal 8’s new APIs to extend its functionality</li>\n<li>Get to grips with the mechanics of the configuration management system and the ability to import and export site configuration</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20160813/Drupal%208%20Development%20Cookbook.pdf","file_format":"PDF","file_size":"6.6 MB","img":"http://www.allitebooks.com/wp-content/uploads/2016/08/Drupal-8-Development-Cookbook-400x494.jpg","language":"English","name":"Drupal 8 Development Cookbook","pages":"370","read_online":"http://www.allitebooks.com/read/index.php?id=23319","year":"2016"},"7":{"author":"Ric Shreves","category":"CMS","code":"1849512760","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Drupal is an award winning open source Content Management System (CMS). Based on PHP and MySQL, its power and flexibility combined with its exceptional design mean it is one of the most popular choices for creating a CMS website..</p>\n<p>Drupal employs a specialized templating system and supports themes, which allow you to change the look and feel of your system’s front and back-end interfaces..</p>\n<p>Drupal 7 Themes is an ideal introduction to theming with Drupal 7. If you want to create a striking new look for your Drupal 7 website, this book is for you. This book is a revised, updated and expanded edition of Drupal 6 Themes, rewritten specifically for Drupal 7.</p>\n<p>This book will show you techniques and tools to help you improve the look and feel of any Drupal 7-powered website. Starting from the basics of theme setup and configuration, you will learn about the Drupal theming architecture and the PHPTemplate engine, and then move on to modifying existing themes and building new themes from scratch. You will find out about tools to make your theme development easier.</p>\n<p>A practical guide showing you how to create themes for your Drupal 7 site</p>\n<p>What you will learn from this book</p>\n<ul>\n<li>Learn about the Drupal 7 Theming Architecture</li>\n<li>Find and install new themes</li>\n<li>Get the most from Drupal’s theme configuration system</li>\n<li>Create a new theme from scratch</li>\n<li>Master PHPTemplate</li>\n<li>Modify the default templates and styles</li>\n<li>Override the default templates with your own</li>\n<li>Create dynamic styling that responds to the content or the user</li>\n<li>Discover tools that make theming easier and more efficient</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20160811/Drupal%207%20Themes.pdf","file_format":"PDF","file_size":"7.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/1470/9957ac251448a0d.jpg","language":"English","name":"Drupal 7 Themes","pages":"316","read_online":"http://www.allitebooks.com/read/index.php?id=23296","year":"2011"},"8":{"author":"Kristen Pol","category":"CMS","code":"1849518181","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>A practical book with plenty of screenshots to guide you through the many features of multilingual Drupal. A demo ecommerce site is provided if you want to practice on a sample site, although you can apply the techniques learnt in the book directly to your site too. Any Drupal users who know the basics of building a Drupal site and are familiar with the Drupal UI, will benefit from this book. No previous knowledge of localization or internationalization is required.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20160605/Drupal%207%20Multilingual%20Sites.pdf","file_format":"PDF","file_size":"2.16 MB","img":"http://www.allitebooks.com/wp-content/uploads/2016/06/Drupal-7-Multilingual-Sites.jpg","language":"English","name":"Drupal 7 Multilingual Sites","pages":"140","read_online":"http://www.allitebooks.com/read/index.php?id=22346","year":"2012"},"9":{"author":"Todd Tomlinson","category":"CMS","code":"1484219694","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>\n<div>\n<p>Learn what Backdrop CMS is and how it fulfills the role of a content management system, along with how to install and configure it. This book teaches how to create and manage content, taxonomy, users, page layouts, and menus to get the best site possible. You’ll also see how to install on shared hosting – which is a focus of the Backdrop CMS team – to make hosting your website affordable.</p>\n<p>Backdrop CMS has a very strong community, and Beginning Backdrop CMS&nbsp;shows you how to leverage Backdrop CMS’s repository of contributed modules and themes to expand the functionality and look of your site, along with how to contribute your own material to the community.</p>\n<p>Beginning Backdrop CMS&nbsp;focuses on the user who is responsible for building, maintaining, and managing an organization’s website and who is interested in Backdrop CMS’s ability to meet their site’s requirements. It covers why you should consider using a content management system when building a new web site.</p>\n<p>By reading this book, you will:</p>\n<ul>\n<li>Understand why you should use Backdrop CMS and the power of the platform.</li>\n<li>Build confidence in your ability to use Backdrop CMS.</li>\n<li>Gain the knowledge necessary to build, deploy, and manage web sites of moderate complexity on Backdrop CMS.</li>\n<li>Understand the process for migrating a Drupal 6 or 7 site to Backdrop CMS.</li>\n</ul>\n</div>\n</div>\n<div>What You Will Learn<p></p>\n</div>\n<div>\n<div>\n<ul>\n<li>How to install a basic Backdrop CMS web site from scratch</li>\n<li>How to create content in your new Backdrop CMS web site</li>\n<li>How to create blocks</li>\n<li>How to create and manage menus and users</li>\n<li>How to create and use layouts when creating pages on your site</li>\n<li>How to create a Backdrop CMS theme</li>\n<li>The basics of a Backdrop CMS module</li>\n</ul>\n</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20160615/Beginning%20Backdrop%20CMS.pdf","file_format":"PDF","file_size":"22.3 MB","img":"http://www.allitebooks.com/wp-content/uploads/1465/8357612180eace9.jpg","language":"English","name":"Beginning Backdrop CMS","pages":"288","read_online":"http://www.allitebooks.com/read/index.php?id=22549","year":"2016"}}