{"0":{"author":"Greg Lukosek","category":"C#","code":"1785287591","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Unity is a cross-platform game engine that is used to develop 2D and 3D video games. Unity 5 is the latest version, released in March 2015, and adds a real-time global illumination to the games, and its powerful new features help to improve a game’s efficiency.</p>\n<p>This book will get you started with programming behaviors in C# so you can create 2D games in Unity. You will begin by installing Unity and learning about its features, followed by creating a C# script. We will then deal with topics such as unity scripting for you to understand how codes work so you can create and use C# variables and methods. Moving forward, you will find out how to create, store, and retrieve data from collection of objects.</p>\n<p>You will also develop an understanding of loops and their use, and you’ll perform object-oriented programming. This will help you to turn your idea into a ready-to-code project and set up a Unity project for production. Finally, you will discover how to create the GameManager class to manage the game play loop, generate game levels, and develop a simple UI for the game.</p>\n<p>By the end of this book, you will have mastered the art of applying C# in Unity.</p>\n<p>Who This Book Is For</p>\n<p>The book is targeted at beginner level Unity developers with no programming experience. If you are a Unity developer and you wish to learn how to write C# scripts and code by creating games, then this book is for you.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Understand the fundamentals of variables, methods, and code syntax in C#</li>\n<li>Get to know about techniques to turn your game idea into working project</li>\n<li>Use loops and collections efficiently in Unity to reduce the amount of code</li>\n<li>Develop a game using the object-oriented programming principles</li>\n<li>Generate infinite levels for your game</li>\n<li>Create and code a good-looking functional UI system for your game</li>\n<li>Publish and share your game with users</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170716/Learning%20C-%20by%20Developing%20Games%20with%20Unity%205.x,%202nd%20Edition.pdf","file_format":"PDF","file_size":"4.8 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/07/Learning-C-by-Developing-Games-with-Unity-5.x-2nd-Edition-400x493.jpg","language":"English","name":"Learning C# by Developing Games with Unity 5.x, 2nd Edition","pages":"230","read_online":"http://www.allitebooks.com/read/index.php?id=27797","year":"2016"},"1":{"author":"Matt Cavanagh","category":"C#","code":"978-1849697828","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>In recent years, electronics have gone from something that only electronic engineers can understand, to a common hobby that is accessible to all. Netduino has grown to be a part of this revolution, providing a development board that is both easy to use, and allows existing .NET developers to build on knowledge they already have.</p>\n<p>Most developers have wild ideas about all the gadgets they would develop to make the world a better (or easier) place, but have no idea how to get beyond blinking an LED. The topics contained go beyond what most books cover, taking an in-depth look at how to use Netduino for practical projects.</p>\n<p>This book starts off by showing you how to do the “hello world” of electronics – fade an LED in and out. It will take you right through all the fundamentals, including how to control a wide range of electronic sensors.</p>\n<p>You will learn how easy it is to automate various parts of your home. You will learn how to open your gate with your smartphone, automatically water your plants, get emailed when someone invades your territory, connect up a keypad to unlock your door, make your own breathalyzer, control your home theatre, and much more!</p>\n<p>What you will learn from this book</p>\n<ul>\n<li>Write some simple code for a Netduino</li>\n<li>Use a microphone to determine the noise level of the room</li>\n<li>Power the sensors and components with external power supplies</li>\n<li>Control existing technology and appliances around your house with transistors and relays</li>\n<li>Link your smartphone to your Netduino with Bluetooth as a controller</li>\n<li>Determine alcohol on your breath</li>\n<li>Use servos to control physical objects</li>\n<li>Use a matrix keypad to secure your house and much more</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170625/Netduino%20Home%20Automation%20Projects.pdf","file_format":"PDF","file_size":"1.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/06/Netduino-Home-Automation-Projects-400x493.jpg","language":"English","name":"Netduino Home Automation Projects","pages":"108","read_online":"http://www.allitebooks.com/read/index.php?id=27680","year":"2013"},"2":{"author":"James Bender","category":"C#","code":"047064320X","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Hands-on guidance to creating great test-driven development practice</p>\n<p>Test-driven development (TDD) practice helps developers recognize a well-designed application, and encourages writing a test before writing the functionality that needs to be implemented. This hands-on guide provides invaluable insight for creating successful test-driven development processes. With source code and examples featured in both C# and .NET, the book walks you through the TDD methodology and shows how it is applied to a real-world application. You’ll witness the application built from scratch and details each step that is involved in the development, as well as any problems that were encountered and the solutions that were applied.</p>\n<ul>\n<li>Clarifies the motivation behind test-driven development (TDD), what it is, and how it works</li>\n<li>Reviews the various steps involved in developing an application and the testing that is involved prior to implementing the functionality</li>\n<li>Discusses unit testing and refactoring</li>\n</ul>\n<p>Professional Test-Driven Development with C# shows you how to create great TDD processes right away.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170327/Professional%20Test%20Driven%20Development%20with%20C-.pdf","file_format":"PDF","file_size":"47.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/03/Professional-Test-Driven-Development-with-C.jpg","language":"English","name":"Professional Test Driven Development with C#","pages":"361","read_online":"http://www.allitebooks.com/read/index.php?id=27050","year":"2011"},"3":{"author":"Arul Kumaravel","category":"C#","code":"0470173939","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Providing you with the programmer?s approach to understanding Windows PowerShell, this book introduces the concepts, components, and development techniques for building software packages that leverage the power of PowerShell. The author team of PowerShell experts shows you how PowerShell makes writing code easy by providing a runtime engine with its own parser, plus you?ll discover that with PowerShell, all of the .NET Framework objects become accessible via scripting, making PowerShell a very powerful addition to your toolbox and a popular choice for future development.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170327/Professional%20Windows%20PowerShell%20Programming.pdf","file_format":"PDF","file_size":"4.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/1490/6458d9bbd8ab45f.jpg","language":"English","name":"Professional Windows PowerShell Programming","pages":"339","read_online":"http://www.allitebooks.com/read/index.php?id=27048","year":"2008"},"4":{"author":"Julian Templeman","category":"ASP.NET C#","code":"1590595726","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>* Steers reader through the spectrum of ASP.NET web programming concepts.</p>\n<p>* Developers and programmers can learn language and theory simultaneously.</p>\n<p>* Professional ASP.NET developers and wannabes can master the core techniques to develop good coding practices to enhance their long-term skill set.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170325/Beginning%20ASP.NET%202.0%20in%20C%202005,%202nd%20Edition.pdf","file_format":"PDF","file_size":"16.3 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/03/Beginning-ASP.NET-2.0-in-C-2005.jpg","language":"English","name":"Beginning ASP.NET 2.0 in C# 2005, 2nd Edition","pages":"1184","read_online":"http://www.allitebooks.com/read/index.php?id=27034","year":"2006"},"5":{"author":"Adam Freeman","category":"ASP.NET C#","code":"143024254X","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>ASP.NET 4.5 remains Microsoft’s preferred technology for creating dynamic websites, providing developers with unrivaled power and flexibility. Pro ASP.NET 4.5 in C# is the most complete reference to ASP.NET that you will find. This comprehensively revised fifth edition will teach you everything you need to know in order to create well-designed ASP.NET websites. Beginning with core concepts the book progresses steadily through key professional skills. You’ll be shown how to query databases in detail, consider the myriad applications of XML, and step through all the considerations you need to be aware of when securing your site from intruders. Finally, you’ll consider advanced topics such as using client-side validation, jQuery and Ajax. By the time you have read this book you will have learned all the skills you need to use ASP.NET 4.5 with confidence. This book is aimed at developers with a basic understanding on the .NET Framework who want to learn how to use it in a professional environment. Migrating readers without this foundation would be well served by reading Beginning ASP.NET 4.5 in C#, also by Apress, before tackling this book.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170325/Pro%20ASP%20.NET%204.5%20in%20C,%205th%20Edition.pdf","file_format":"PDF","file_size":"23.6 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/03/Pro-ASP-.NET-4.5-in-C-5th-Edition.jpg","language":"English","name":"Pro ASP .NET 4.5 in C#, 5th Edition","pages":"1187","read_online":"http://www.allitebooks.com/read/index.php?id=27037","year":"2013"},"6":{"author":"Mathieu Nayrolles","category":"C#","code":"1849691401","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Multiplatform applications have taken the development world by storm. This has revolutionized the selection of the right tools for the efficient development and deployment of applications. Xamarin studio is emerging as the preferred choice among .NET/C# developers. It enables them to design cross-platform applications using their favorite language and IDE. Xamarin studio is supported by the Mac OS and Windows platforms, and you can develop your own applications for iOS, Windows, or Android with its help.</p>\n<p>This book takes you through all the stages of application development, right from getting started with Xamarin and developing a GUI to putting up your application on the store. The recipes will help you in acquiring sufficient knowledge to go about creating applications.</p>\n<p>Starting with introducing Xamarin studio, its underlying technologies, and the Android ecosystem, the book goes on to cover the graphical aspects of creating Android applications. Moving on, you will learn more about data management with Android services. This is followed by techniques on how to interact with the Android OS and the phone’s hardware, before finally concluding with mobile advertisements and Google Play. By the end of this book, you will have discovered all the specialties related to developing Android application with Xamarin Studio.</p>\n<p>Who This Book Is For</p>\n<p>If you have already developed an Android applications with Java and you now intend to use C# and Xamarin Studio’s capabilities, or if you have never taken the dive into mobiles, then this book is for you. It would be helpful to have some C# experience so you follow the recipes in this book, though knowledge of Android is not required.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Build a GUI for your Android applications</li>\n<li>Explore Android activities and understand configuration changes</li>\n<li>Manage multiscreens, icons, and multimedia in your applications</li>\n<li>Start and bind Android services and create notifications</li>\n<li>Create beautiful applications using the camera and animations</li>\n<li>Effectively couple your phone’s hardware with applications</li>\n<li>Integrate advertisements and select the right advertisement providers for your applications</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170313/Xamarin%20Studio%20for%20Android%20Programming.pdf","file_format":"PDF","file_size":"3.4 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/03/Xamarin-Studio-for-Android-Programming-400x493.jpg","language":"English","name":"Xamarin Studio for Android Programming: A C# Cookbook","pages":"298","read_online":"http://www.allitebooks.com/read/index.php?id=26867","year":"2015"},"7":{"author":"Grant Palmer","category":"C#","code":"1430210885","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Updated with the changes to C#, Beginning C# 2008 Objects: From Concepts to Code introduces complete beginners to C# coding practice with a solid methodological foundation written by two critically–acclaimed experts in the field, already authors of the best–selling Beginning C# Objects.</p>\n<p>By building from first principles in object–oriented terminology, then advancing through application design with Unified Modeling Language (UML) into practical examples, Beginning C# 2008 Objects: From Concepts to Code provides a foundational guide written from the perspective of two experienced, working authorities on C#.</p>\n<p>Working coders will benefit from the object–oriented cast of the book and its section on use–case modeling. This is the book to read if you want to deepen and advance your existing professional development in C# with an eye towards advancing out of pure coding work.</p>\n<p>For the reader wishing to “simply learn C#”, this book will provide exactly that. In addition to listing code and syntax, Beginning C# 2008 Objects: From Concepts to Code also walks you through the design and architecting of a functioning C# application, showing the “why” and the “how” of the development decisions that go into professional C# coding.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170226/Beginning%20C%202008%20Objects.pdf","file_format":"PDF","file_size":"6.8 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/02/Beginning-C-2008-Objects.jpg","language":"English","name":"Beginning C# 2008 Objects","pages":"680","read_online":"http://www.allitebooks.com/read/index.php?id=26648","year":"2008"},"8":{"author":"Patrick Felicia","category":"C# Game Programming","code":"1520118171","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>In this book, the first in the “Beginner’s Guide” series, you will create a simple 2D platform game, create challenging gameplay and learn techniques to code more in less time.</p>\n<p>This book can be read as a standalone (you don’t need to have read the previous books in the series, although it may help) and focuses on: scoring system and lives (e.g., keeping track of the score across the game), user interface (menus and in-game information for 2D games), character movement (e.g., walk, run, jump, crouch, etc.), character interaction (i.e., collect objects or avoid other objects), playful game-mechanics (e.g., bouncing objects, moving platforms, time-limited level, collapsing bridges, etc.) and improving C# programing skills (e.g., important and useful functions and principles that you can reuse in your own games).</p>\n<p>The main idea behind this book is to save you some headaches when you need to create your 2D platformer and to help you to find the time to actually code your game, by explaining simple and effective ways and best coding practices that you can use easily to create more code (and games) in less time with less stress and more fun.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170125/A%20Beginner's%20Guide%20to%202D%20Platform%20Games%20with%20Unity.pdf","file_format":"PDF","file_size":"2.2 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/01/A-Beginners-Guide-to-2D-Platform-Games-with-Unity.jpg","language":"English","name":"A Beginner’s Guide to 2D Platform Games with Unity","pages":"211","read_online":"http://www.allitebooks.com/read/index.php?id=26291","year":"2016"},"9":{"author":"Dirk Strauss","category":"C#","code":"1786467305","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>During your application development workflow, there is always a moment when you need to get out of a tight spot. Through a recipe-based approach, this book will help you overcome common programming problems and get your applications ready to face the modern world.</p>\n<p>We start with C# 6, giving you hands-on experience with the new language features. Next, we work through the tasks that you perform on a daily basis such as working with strings, generics, and lots more. Gradually, we move on to more advanced topics such as the concept of object-oriented programming, asynchronous programming, reactive extensions, and code contracts.</p>\n<p>You will learn responsive high performance programming in C# and how to create applications with Azure. Next, we will review the choices available when choosing a source control solution. At the end of the book, we will show you how to create secure and robust code, and will help you ramp up your skills when using the new version of C# 6 and Visual Studio</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Write better and less code to achieve the same result as in previous versions of C#.</li>\n<li>Generate tests from the Code Contracts for mission critical methods.</li>\n<li>Integrate code in Visual Studio with GitHub.</li>\n<li>Create a web application in Azure.</li>\n<li>Design and build a microservice architecture</li>\n<li>Demystify the Rx library using Reactive extensions</li>\n<li>Write high performing codes in C# and understanding multi-threading.</li>\n<li>Security and Debugging.</li>\n<li>Implement Code Contracts on code in Visual Studio.</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170119/C-%20Programming%20Cookbook.pdf","file_format":"PDF","file_size":"34.3 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/01/C-Programming-Cookbook-400x493.jpg","language":"English","name":"C# Programming Cookbook","pages":"476","read_online":"http://www.allitebooks.com/read/index.php?id=26235","year":"2016"}}