{"0":{"author":"Adam Freeman","category":"C & C++ .NET","code":"1484229150","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Discover Angular, the leading client-side web framework, from the point of view of an ASP.NET Core MVC developer. Best-selling author&nbsp;Adam Freeman&nbsp;brings these two key technologies together and explains how to use ASP.NET Core MVC to provide back-end services for Angular applications. This fast-paced, practical guide starts from the nuts and bolt and gives you the knowledge you need to combine Angular (from version 2.0 up) and ASP.NET Core MVC in your projects.<p></p>\n</div>\n<div></div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Gain a solid understanding of how ASP.NET Core MVC and Angular can work together</li>\n<li>Learn how to use Visual Studio 2017 to develop Angular/ASP.NET Core MVC projects</li>\n<li>Learn how create ASP.NET Core RESTful web services to support Angular applications</li>\n<li>Learn how to expose data from Entity Framework Core to Angular applications</li>\n<li>Learn how to use ASP.NET Core Identity to provide security services to Angular applications</li>\n</ul>\n</div>\n<div>Each topic is covered clearly and concisely and is packed with the essential details you need to learn to be truly effective.<p></p>\n</div>\n<div></div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>This book is for developers with a knowledge of ASP.NET Core MVC who are introducing Angular into their projects.</div>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170726/Essential%20Angular%20for%20ASP.NET%20Core%20MVC.pdf","file_format":"PDF","file_size":"17.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/07/Essential-Angular-for-ASP.NET-Core-MVC.jpg","language":"English","name":"Essential Angular for ASP.NET Core MVC","pages":"297","read_online":"http://www.allitebooks.com/read/index.php?id=27864","year":"2017"},"1":{"author":"Shirish Chavan","category":"C & C++","code":"1484229665","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>\n<p>Solve your C programming problems with practical and informative recipes. This book covers various aspects of C programming including the fundamentals of C, operators and expressions, control statements, recursion, and user-defined functions. Each chapter contains a series of recipes that you can easily reference to quickly find the answers you are looking for.</p>\n<p>C Recipes&nbsp;also contains recipes and solutions for problems in memory management, arrays, standard input and output, structures and unions, pointers, self-referential structures, data files, pre-processor directives, and library functions.</p>\n</div>\n<div></div>\n<div>What You Will Learn<p></p>\n</div>\n<div>\n<div>\n<ul>\n<li>Master operators and expressions</li>\n<li>Write user-defined functions</li>\n<li>Work with structures and unions</li>\n<li>Use pointers</li>\n<li>Define self referential structures</li>\n<li>Leverage library functions</li>\n</ul>\n<div></div>\n</div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>Those with some experience in C programming.</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170729/C%20Recipes.pdf","file_format":"PDF","file_size":"6.1 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/07/C-Recipes.jpg","language":"English","name":"C Recipes","pages":"446","read_online":"http://www.allitebooks.com/read/index.php?id=27890","year":"2017"},"2":{"author":"Dale Green","category":"C & C++ Game Programming Cloud & Virtualization","code":"1785886711","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Procedural generation is a growing trend in game development. It allows developers to create games that are bigger and more dynamic, giving the games a higher level of replayability. Procedural generation isn’t just one technique, it’s a collection of techniques and approaches that are used together to create dynamic systems and objects. C++ is the industry-standard programming language to write computer games. It’s at the heart of most engines, and is incredibly powerful. SFML is an easy-to-use, cross-platform, and open-source multimedia library. Access to computer hardware is broken into succinct modules, making it a great choice if you want to develop cross-platform games with ease.</p>\n<p>Using C++ and SFML technologies, this book will guide you through the techniques and approaches used to generate content procedurally within game development.</p>\n<p>Throughout the course of this book, we’ll look at examples of these technologies, starting with setting up a roguelike project using the C++ template. We’ll then move on to using RNG with C++ data types and randomly scattering objects within a game map. We will create simple console examples to implement in a real game by creating unique and randomised game items, dynamic sprites, and effects, and procedurally generating game events. Then we will walk you through generating random game maps. At the end, we will have a retrospective look at the project.</p>\n<p>By the end of the book, not only will you have a solid understanding of procedural generation, but you’ll also have a working roguelike game that you will have extended using the examples provided.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170623/Procedural%20Content%20Generation%20for%20C++%20Game%20Development.pdf","file_format":"PDF","file_size":"3.4 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/06/Procedural-Content-Generation-for-C-Game-Development-400x493.jpg","language":"English","name":"Procedural Content Generation for C++ Game Development","pages":"304","read_online":"http://www.allitebooks.com/read/index.php?id=27648","year":"304"},"3":{"author":"Thomas Finnegan","category":"C & C++","code":"1849692017","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Powerful and continuing to grow, the mobile market has never been bigger and more demanding of great games. Android continues to prove itself as a strong contender in this challenging market. With Unity 3D, great games can be made for Android quickly and easily. With its great deployment system, the Android platform is now only one click away.</p>\n<p>Unity Android Game Development by Example Beginner’s Guide dives straight into making real, fully-functional games, with hands-on examples and step-by-step instructions to give you a firm grounding in Unity 3D and Android. Everything necessary for creating a complete gaming experience is covered and detailed throughout the course of this book.</p>\n<p>Using clear and practical examples that progressively build upon each other, this book guides you through the process of creating games in Unity for Android.</p>\n<p>Start by learning about all the great features that Unity and Android have to offer. Next, create a Tic-Tac-Toe game while learning all about interfaces. After that, learn about meshes, materials, and animations with the creation of a tank battle game. You will then learn how to expand your game’s environment with the addition of shadows and a skybox. Adding on this, you will also learn how to expand the tank battle by creating enemies and using path finding to chase the player. Next, explore touch and tilt controls with the creation of a space fighter game. Then, learn about physics while recreating the most popular mobile game on the market. You will then expand the space fighter game with the addition of all the special effects that make a game great. Finally, complete your experience by learning the optimization techniques required to keep your games running smoothly.</p>\n<p>While Unity is available for both Mac and Windows, the book is presented working from a Windows environment. Programming in Unity is possible in C#, JavaScript, and Boo. This book will be working in C# and the final projects will be provided in C# and JavaScript.</p>\n<p>From nothing to a fully-featured mobile game, Unity Android Game Development by Example Beginner’s Guide takes you through everything it takes to create your next game for the Android platform.</p>\n<p>What you will learn from this book</p>\n<ul>\n<li>Set up a development environment to work with both Unity and Android</li>\n<li>Import and work with the basic building blocks of a game: meshes, materials, and animations</li>\n<li>Utilize particles and sound effects to provide feedback to the player</li>\n<li>Adjust camera effects and game logic to create 2D games</li>\n<li>Interface with touch and tilt inputs to create custom control systems</li>\n<li>Set up path finding to create intelligently moving characters</li>\n<li>Successfully create custom graphical interfaces</li>\n<li>Set up and utilize physics to create a mobile game classic</li>\n<li>Create dynamically lit scenes using lightmaps</li>\n<li>Understand the best choices for optimizing a game for the mobile platform</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170522/Unity%20Android%20Game%20Development%20by%20Example%20Beginner's%20Guide.pdf","file_format":"PDF","file_size":"20.5 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/05/Unity-Android-Game-Development-by-Example-Beginners-Guide-400x493.jpg","language":"English","name":"Unity Android Game Development by Example Beginner’s Guide","pages":"320","read_online":"http://www.allitebooks.com/read/index.php?id=27470","year":"2013"},"4":{"author":"Mindaugas Pocius","category":"C & C++","code":"1785281690","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Microsoft Dynamics AX 2012 R3 Development Cookbook will help you manage your company’s or customer’s ERP information and operations efficiently. Beginning with exploring data manipulation concepts in Dynamics AX, you will build scripts to assist data migration and organize data in AX forms. You will learn how to create custom lookups using AOT forms and generate them dynamically. After this, you’ll learn how to enhance your application by using advanced form controls, and integrate your system with other external systems. You will also learn how to enhance your user interface using various Dynamics AX UI elements.</p>\n<p>This book will help you look at application development from a business process perspective, and develop enhanced ERP solutions by learning and implementing the best practices and techniques.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Explore data manipulation concepts in Dynamics AX</li>\n<li>Build scripts to assist data migration processes</li>\n<li>Organize data in Dynamics AX forms</li>\n<li>Make custom lookups using AOT forms and dynamically generate them from the X++ code</li>\n<li>Create a custom electronic payment format and process a vendor payment using it</li>\n<li>Integrate your application with Microsoft Office Suite and with external systems using various approaches</li>\n<li>Export and import business data for further distribution or analysis</li>\n<li>Improve your development efficiency and experience</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170415/Microsoft%20Dynamics%20AX%202012%20R3%20Development%20Cookbook.pdf","file_format":"PDF","file_size":"8.6 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/04/Microsoft-Dynamics-AX-2012-R3-Development-Cookbook-400x493.jpg","language":"English","name":"Microsoft Dynamics AX 2012 R3 Development Cookbook","pages":"420","read_online":"http://www.allitebooks.com/read/index.php?id=27226","year":"2015"},"5":{"author":"Nazmus Saquib","category":"C & C++","code":"1783282991","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Mathematica, developed and maintained by Wolfram Research, is a trusted and popular tool used to analyze and visualize data.</p>\n<p>This book begins by introducing you to the Mathematica environment and the basics of dataset loading and cleaning. You will then learn about the different kinds of widely used datasets so that you are comfortable with the later chapters. Then, in the subsequent chapters, you will learn about time series, scientific, statistical, information, and map visualizations. Each topic is demonstrated by walking you through an example project. Along the way, the dynamic interactivity and graphics packages are also introduced. Finally, the book ends with a brief discussion of color maps and aesthetics issues.</p>\n<p>Using this book, you will learn how to build visualizations from scratch, quickly and efficiently.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Understand some widely used datasets in science, engineering, finance, statistics, and business</li>\n<li>Write Mathematica programs to create stunning, interactive, and beautiful visualizations</li>\n<li>Create time series visualizations in different scenarios to find underlying patterns in time series data</li>\n<li>Build a protein molecule visualization tool and create basic isocontour and isosurface visualizations in Mathematica</li>\n<li>Create statistical plots and charts and learn the basics of visualizing high dimensional datasets</li>\n<li>Develop a word frequency visualization tool</li>\n<li>Build graph network visualizations and interactive chord charts</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170409/Mathematica%20Data%20Visualization.pdf","file_format":"PDF","file_size":"4.1 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/04/Mathematica-Data-Visualization-400x493.jpg","language":"English","name":"Mathematica Data Visualization","pages":"142","read_online":"http://www.allitebooks.com/read/index.php?id=27178","year":"2014"},"6":{"author":"Nick Harrison","category":"C & C++ .NET","code":"1484222105","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Learn how&nbsp;Roslyn’s new code generation capability&nbsp;will let you write software that is more concise, runs faster, and is easier to maintain. You will learn from real-world business applications&nbsp;to create better software by letting the computer write its own code based on your business logic already defined in lookup tables.</div>\n<div>\n<div></div>\n<div>\n<div>Code Generation with Rosyln is the first book to cover this new capability.&nbsp; You will learn how these techniques can&nbsp;be used to simplify systems integration so that if one system already defines business logic through lookup tables, you can integrate a new system and share business logic by allowing the new system to write its own business logic based on already existing table-based business logic.</div>\n<div></div>\n<div></div>\n<p>One of the many benefits you will discover is that Roslyn uses an innovative approach to compiler design, opening up the inner workings of the compiler process. You will&nbsp;learn how to see the syntax tree that Roslyn is building as it compiles your code. Additionally,&nbsp;you&nbsp;will learn to&nbsp;feed it your own syntax tree that&nbsp;you create on the fly.</p>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>What You Will Learn:</div>\n<div></div>\n<div>• Structure logic to be stored in database design</div>\n<div>• Build complex conditional logic based on lookup data in the database</div>\n<p>• Compile code that you generate programmatically</p>\n<div>• Discover generated code and run it dynamically to implement new business logic</div>\n<div>• Debug problems in generated code</div>\n<div>• Deploy and access generated code</div>\n</div>\n<div></div>\n<div>Who This Book Is For:</div>\n<div></div>\n<div>Back end developers in very dynamic fast-paced business environments. &nbsp; Developers focused on integrating different systems across an enterprise should also find this information useful.</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170301/Code%20Generation%20with%20Roslyn.pdf","file_format":"PDF","file_size":"1.6 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/03/Code-Generation-with-Roslyn.jpg","language":"English","name":"Code Generation with Roslyn","pages":"105","read_online":"http://www.allitebooks.com/read/index.php?id=26687","year":"2017"},"7":{"author":"Joanna Lee","category":"C & C++","code":"1784398152","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Unreal Engine 4 is a powerful game development engine that provides rich functionalities to create 2D and 3D games across multiple platforms. Many people know what a game is and they play games every day, but how many of them know how to create a game? Unreal Engine technology powers hundreds of games, and thousands of individuals have built careers and companies around skills developed using this engine.</p>\n<p>Learning Unreal Engine 4 Game Development starts with small, simple game ideas and playable projects that you can actually finish. The book first teaches you the basics of using Unreal Engine to create a simple game level. Then, you’ll learn how to add details such as actors, animation, effects, and so on to the game. The complexity will increase over the chapters and the examples chosen will help you learn a wide variety of game development techniques. This book aims to equip you with the confidence and skills to design and build your own games using Unreal Engine 4. By the end of this book, you’ll have learnt about the entire Unreal suite and know how to successfully create fun, simple games.</p>\n<p>What you will learn</p>\n<ul>\n<li>Learn what a game engine is, the history of Unreal Engine, and how game studios create games</li>\n<li>Explore the Unreal Engine 4 editor controls and learn how to use the editor to create a room in a game level</li>\n<li>Understand the basic structures of objects in a game, such as the differences between BSP and static meshes</li>\n<li>Make objects interactive using level blueprints</li>\n<li>Learn more about computer graphics rendering; how materials and light are rendered in your game</li>\n<li>Get acquainted with the Material Editor to create materials and use different types of lights in the game levels</li>\n<li>Utilize the various editors, tools, and features such as UI, the particle system, audio, terrain manipulation, and cinematics in Unreal Engine 4 to create game levels</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170204/Learning%20Unreal%20Engine%20Game%20Development.pdf","file_format":"PDF","file_size":"18.7 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/02/Learning-Unreal-Engine-Game-Development-400x493.jpg","language":"English","name":"Learning Unreal Engine Game Development","pages":"468","read_online":"http://www.allitebooks.com/read/index.php?id=26404","year":"2016"},"8":{"author":"John P. Doran","category":"C & C++","code":"1784398160","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Unreal Engine is powerful tool with rich functionalities to create games. It equips you with the skills to easily build mobile and desktop games from scratch without worrying about which platform they will run on. You can focus on the individual complexities of game development such as animation and rendering.</p>\n<p>This book takes you on a journey to jumpstart your game design efforts. You will learn various aspects of the Unreal engine commonly encountered with practical examples of how it can be used, with numerous references for further study. You will start by getting acquainted with Unreal Engine 4 and building out levels for your game. This will be followed by recipes to help you create environments, place meshes, and implement your characters. You will then learn to work with lights, camera, and shadows to include special effects in your game. Moving on, you’ll learn Blueprint scripting and C++ programming to enable you to achieve trigger effects and add simple functionalities. By the end of the book, you will see how to create a healthbar and main menu, and then get your game ready to be deployed and published.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Discover editor functionalities for an in-depth insight into game design</li>\n<li>Develop environments using terrain for outdoor areas and a workflow for interiors as well using brushes</li>\n<li>Design various kinds of materials with unique features, such as mirrors and glows</li>\n<li>Explore the various ways that lighting can be used in the engine</li>\n<li>Build various level effects using Blueprints, Unreal’s visual scripting system</li>\n<li>Set up a development environment and develop custom functionality with C++ for your games</li>\n<li>Create healthbars and main menus with animations using Slate, Unreal’s UI solution, through the UMG Editor</li>\n<li>Package and create an installer to get your project out into the world</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170204/Unreal%20Engine%20Game%20Development%20Cookbook.pdf","file_format":"PDF","file_size":"16.9 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/02/Unreal-Engine-Game-Development-Cookbook-400x493.jpg","language":"English","name":"Unreal Engine Game Development Cookbook","pages":"326","read_online":"http://www.allitebooks.com/read/index.php?id=26400","year":"2015"},"9":{"author":"Ray Lischner","category":"C & C++","code":"1590597494","content":"\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>This is a book about learning by doing and is aimed at programmers familiar with programming, but not C++. The key exercises are not simply listed at the end of the chapter, but are integrated into the main text. Readers work hands-on throughout the book. Each lesson poses numerous questions, asking readers to write answers directly in the book. The book includes answers to all questions, so readers can check their work. These exercises are not simple cookbook-style recipes (e.g., “Write a program to do xyz”). Instead, they are explorations―structured labs that guide readers through a series of steps to highlight specific features of C++.</p>\n\t\t\t\t\t\t\t\t\t\t\t","download_links":"http://file.allitebooks.com/20170130/Exploring%20C++.pdf","file_format":"PDF","file_size":"12.8 MB","img":"http://www.allitebooks.com/wp-content/uploads/2017/01/Exploring-C-.jpg","language":"English","name":"Exploring C++","pages":"704","read_online":"http://www.allitebooks.com/read/index.php?id=26335","year":"2008"}}