{
  "0": {
    "author": "Nishith Pathak",
    "category": ".NET",
    "code": "1484229487",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>\n<div>\n<p>Get introduced to the world of artificial intelligence with this accessible and practical guide. Build applications that make intelligent use of language and user interaction to better compete in today’s marketplace. Discover how your application can deeply understand and interpret content on the web or a user’s machine, intelligently react to direct user interaction through speech or text, or make smart recommendations on products or services that are tailored to each individual user.</p>\n<p>With Microsoft Cognitive Services, you can do all this and more utilizing a set of easy-to-use APIs that can be consumed on the desktop, web, or mobile devices. Developers normally think of AI implementation as a tough task involving writing complex algorithms. This book aims to remove the anxiety by creating a cognitive application with a few lines of code. There is a wide range of Cognitive Services APIs available. This book focuses on some of the most useful and powerful ways that your application can make intelligent use of language.</p>\n<p>Artificial Intelligence for .NET: Speech, Language, and Search&nbsp;will show you how you can start building amazing capabilities into your applications today.</p>\n</div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Understand the underpinnings of artificial intelligence through practical examples and scenarios</li>\n<li>Get started building an AI-based application in Visual Studio</li>\n<li>Build a text-based conversational interface for direct user interaction</li>\n<li>Use the Cognitive Services Speech API to recognize and interpret speech</li>\n<li>Look at different models of language, including natural language processing, and how to apply them in your Visual Studio application</li>\n<li>Reuse Bing search capabilities to better understand a user’s intention</li>\n<li>Work with recommendation engines and integrate them into your apps</li>\n</ul>\n</div>\n<div></div>\n</div>\n<div>Who This Book Is For<p></p>\n</div>\n<div>Developers working on a range of platforms, from .NET and Windows to mobile devices. Examples are given in C#. No prior experience with AI techniques or theory is required.</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170817/Artificial%20Intelligence%20for%20.NET.pdf",
    "file_format": "PDF",
    "file_size": "9.1 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/08/Artificial-Intelligence-for-.NET_.jpg",
    "language": "English",
    "name": "Artificial Intelligence for .NET",
    "pages": "264",
    "read_online": "http://www.allitebooks.com/read/index.php?id=27988",
    "year": "2017"
  },
  "1": {
    "author": "Adam Freeman",
    "category": "C & C++ .NET",
    "code": "1484229150",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Discover Angular, the leading client-side web framework, from the point of view of an ASP.NET Core MVC developer. Best-selling author&nbsp;Adam Freeman&nbsp;brings these two key technologies together and explains how to use ASP.NET Core MVC to provide back-end services for Angular applications. This fast-paced, practical guide starts from the nuts and bolt and gives you the knowledge you need to combine Angular (from version 2.0 up) and ASP.NET Core MVC in your projects.<p></p>\n</div>\n<div></div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Gain a solid understanding of how ASP.NET Core MVC and Angular can work together</li>\n<li>Learn how to use Visual Studio 2017 to develop Angular/ASP.NET Core MVC projects</li>\n<li>Learn how create ASP.NET Core RESTful web services to support Angular applications</li>\n<li>Learn how to expose data from Entity Framework Core to Angular applications</li>\n<li>Learn how to use ASP.NET Core Identity to provide security services to Angular applications</li>\n</ul>\n</div>\n<div>Each topic is covered clearly and concisely and is packed with the essential details you need to learn to be truly effective.<p></p>\n</div>\n<div></div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>This book is for developers with a knowledge of ASP.NET Core MVC who are introducing Angular into their projects.</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170726/Essential%20Angular%20for%20ASP.NET%20Core%20MVC.pdf",
    "file_format": "PDF",
    "file_size": "17.9 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/07/Essential-Angular-for-ASP.NET-Core-MVC.jpg",
    "language": "English",
    "name": "Essential Angular for ASP.NET Core MVC",
    "pages": "297",
    "read_online": "http://www.allitebooks.com/read/index.php?id=27864",
    "year": "2017"
  },
  "2": {
    "author": "Marshall Copeland",
    "category": ".NET",
    "code": "1484227395",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>\n<div>Prevent destructive attacks to your Azure public cloud infrastructure, remove vulnerabilities, and instantly report cloud security readiness. This book provides comprehensive guidance from a security insider’s perspective.</div>\n<div>\n<div>Cyber Security on Azure&nbsp;explains how this ‘security as a service’ (SECaaS) business solution can help you better manage security risk and enable data security control using encryption options such as Advanced Encryption Standard (AES) cryptography. Discover best practices to support network security groups, web application firewalls, and database auditing for threat protection. Configure custom security notifications of potential cyberattack vectors to prevent unauthorized access by hackers, hacktivists, and industrial spies.</div>\n<div></div>\n<div>What You’ll Learn</div>\n<div></div>\n<div>This book provides step-by-step guidance on how to:</div>\n<div>\n<ul>\n<li>Support enterprise security policies</li>\n<li>Improve cloud security</li>\n<li>Configure intrusion detection</li>\n<li>Identify potential vulnerabilities</li>\n<li>Prevent enterprise security failures</li>\n</ul>\n</div>\n</div>\n</div>\n<div></div>\n<p>Who This Book Is For</p>\n<div>\n<div>IT, cloud, and security administrators; CEOs, CIOs, and other business professionals</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170719/Cyber%20Security%20on%20Azure.pdf",
    "file_format": "PDF",
    "file_size": "12.3 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/07/Cyber-Security-on-Azure.jpg",
    "language": "English",
    "name": "Cyber Security on Azure",
    "pages": "208",
    "read_online": "http://www.allitebooks.com/read/index.php?id=27814",
    "year": "2017"
  },
  "3": {
    "author": "Sean Ong",
    "category": ".NET",
    "code": "1484227689",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Develop applications and experiences for Microsoft’s HoloLens and other Windows mixed reality devices. This easy-to-follow guide removes the mystery behind creating amazing augmented reality experiences. Mixed reality development tools and resources are provided.<p></p>\n</div>\n<div></div>\n<div></div>\n<div>Beginning Windows Mixed Reality Programming<b>&nbsp;</b>clearly explains all the nuances of mixed reality software development. You’ll learn how to create 3D objects and holograms, interact with holograms using voice commands and hand gestures, use spatial mapping and 3D spatial sound, build with Microsoft’s HoloToolkit, create intuitive user interfaces, and make truly awe-inspiring mixed reality experiences. Start building the holographic future today!<p></p>\n</div>\n<div></div>\n<p>What You Will Learn</p>\n<div>\n<div>\n<ul>\n<li>Prototype ideas quickly</li>\n<li>Get started with Unity, the preferred tool for animating 3D objects.</li>\n<li>Explore where to find 3D models for your project, or make your own!</li>\n<li>Use spatial sound, voice commands, and gestures</li>\n<li>Build with the HoloToolkit to make apps the easy way</li>\n<li>Publish to the Windows Store and make money from your app</li>\n</ul>\n</div>\n</div>\n<p>Who This Book Is For</p>\n<div></div>\n<div>Programmers with little or no graphics or mixed reality experience</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170725/Beginning%20Windows%20Mixed%20Reality%20Programming.pdf",
    "file_format": "PDF",
    "file_size": "10.2 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/07/Beginning-Windows-Mixed-Reality-Programming.jpg",
    "language": "English",
    "name": "Beginning Windows Mixed Reality Programming",
    "pages": "222",
    "read_online": "http://www.allitebooks.com/read/index.php?id=27860",
    "year": "2017"
  },
  "4": {
    "author": "Ben Dewey",
    "category": ".NET",
    "code": "1484224779",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>\n<p>Learn how to build web applications from three Microsoft MVPs. After building the data application layer using Entity Framework Core and a RESTful service using ASP.NET Core, you will then build the client side web application three ways: first, using ASP.NET Core, then using Angular 2, and, finally, using React. &nbsp;You will be able to compare and contrast these UI frameworks and select the best one for your needs.</p>\n<p>.NET Core is a complete rewrite of the popular .NET and its related frameworks. While many concepts are similar between .NET Core and the .NET 4.6 framework, there are revolutionary changes as well, including updates to Entity Framework Core and ASP.NET Core. The first section of this book covers the three main parts of building applications with C#: Entity Framework, ASP.NET Core Services, and ASP.NET Core Web Applications.</p>\n<p>There is also an explosion in popularity of JavaScript frameworks for client side development, and the authors cover two of the most popular UI frameworks. Start with TypeScript for developing clean JavaScript, along with a client side build tool such as Gulp, Grunt, and WebPack. Using the same data access layer and RESTful service from the .NET Core application, you can rebuild the UI using Angular 2. Then, repeat the process using React, for a true comparison of building client side applications using ASP.NET Core, Angular 2, and React.</p>\n<p>What You’ll Learn</p>\n<ul>\n<li>Understand the fundamentals of .NET Core and what that means to the traditional .NET developer</li>\n<li>Build a data access layer with Entity Framework Core, a RESTful service with ASP.NET Core MVC, and a website with ASP.NET Core MVC and Bootstrap</li>\n<li>Automate many build tasks with client side build utilities</li>\n</ul>\n<div>Who This Book Is For</div>\n</div>\n<div></div>\n<p>Intermediate to advanced .NET developers</p>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170709/Building%20Web%20Applications%20with%20Visual%20Studio%202017.pdf",
    "file_format": "PDF",
    "file_size": "8.6 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/07/Building-Web-Applications-with-Visual-Studio-2017.jpg",
    "language": "English",
    "name": "Building Web Applications with Visual Studio 2017",
    "pages": "393",
    "read_online": "http://www.allitebooks.com/read/index.php?id=27759",
    "year": "2017"
  },
  "5": {
    "author": "Gerald Versluis",
    "category": ".NET",
    "code": "1484227158",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Learn everything you need to set up a full-featured, automated pipeline for Xamarin development and deployment. Automate everything from the build step through to deployment and delivery to your customer. If you thought this level of automation could be achieved only by large companies with generous funding, think again! You as a single developer, or working in a small team or company, can automate your processes to punch heavier than your weight. What’s more, you can achieve this level of automation completely for free!</div>\n<div></div>\n<div>This hands-on guide takes you step-by-step from setting up your first automated build all the way to integrated unit testing, and finally through to delivering a high-quality app to your testers and end users. The automation presented in this book saves a lot of frustration and recurring work, providing you more time to focus on building the robust and compelling apps that delight your customers and keep you steps ahead of the competition. Not only does this book teach how to get a grip on consistent quality, but it covers the use of HockeyApp to track events and usage, and to report errors and anomalies back to home base for developers to investigate. Many times it’s possible to detect and fix errors before a user even notices they are there.</div>\n<div></div>\n<div>This book:</div>\n<div>\n<ul>\n<li>Teaches the necessity of an automated development pipeline</li>\n<li>Helps you set up an automated pipeline for Xamarin development</li>\n<li>Integrates testing (on physical devices!) to ensure high-quality apps</li>\n</ul>\n</div>\n<div>What You’ll Learn</div>\n<div>\n<div>\n<ul>\n<li>Why you want an automated development pipeline</li>\n<li>Obtain and configure the automated tooling</li>\n<li>Continuously integrate your apps</li>\n<li>Run automated unit tests</li>\n<li>Push updates to your customers</li>\n<li>Monitor and detect errors without user intervention</li>\n</ul>\n</div>\n</div>\n<div></div>\n<p>Who This Book Is For</p>\n<div></div>\n<div>\n<div>App developers looking for ways to ensure consistent quality of work and wanting to know how their apps are doing in actual use by customers</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170510/Xamarin%20Continuous%20Integration%20and%20Delivery.pdf",
    "file_format": "PDF",
    "file_size": "7.9 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/05/Xamarin-Continuous-Integration-and-Delivery.jpg",
    "language": "English",
    "name": "Xamarin Continuous Integration and Delivery",
    "pages": "197",
    "read_online": "http://www.allitebooks.com/read/index.php?id=27405",
    "year": "2017"
  },
  "6": {
    "author": "Nathan Good",
    "category": ".NET",
    "code": "1590594975",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>Regular expressions are an essential part of programming, but they can be difficult to cope with. Enter Regular Expression Recipes for Windows Developers. This is the only book of its kind that presents material in a functional, concise manner. It contains over 100 of the most popular regular expressions, along with explanations of how to use each one. It also covers all of the major development languages, including JavaScript, VB, VB .NET, and C#.</p>\n<p>Author Nathan A. Good teaches by example and provides concise syntax references as necessary throughout the book. You’re sure to find his examples accurate and relevant. This book is an ideal solutions guide for you to keep in a handy place for quick reference.</p>\n<p>Table of Contents</p>\n<ol>\n<li>Words and Text</li>\n<li>URLs and Paths</li>\n<li>CSV and Tab-Delimited Files</li>\n<li>Formatting and Validating</li>\n<li>HTML and XML</li>\n<li>Source Code</li>\n</ol>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170318/Regular%20Expression%20Recipes%20for%20Windows%20Developers.pdf",
    "file_format": "PDF",
    "file_size": "1.3 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/03/Regular-Expression-Recipes-for-Windows-Developers.jpg",
    "language": "English",
    "name": "Regular Expression Recipes for Windows Developers",
    "pages": "400",
    "read_online": "http://www.allitebooks.com/read/index.php?id=26947",
    "year": "2005"
  },
  "7": {
    "author": "Nick Harrison",
    "category": "C & C++ .NET",
    "code": "1484222105",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<div>Learn how&nbsp;Roslyn’s new code generation capability&nbsp;will let you write software that is more concise, runs faster, and is easier to maintain. You will learn from real-world business applications&nbsp;to create better software by letting the computer write its own code based on your business logic already defined in lookup tables.</div>\n<div>\n<div></div>\n<div>\n<div>Code Generation with Rosyln is the first book to cover this new capability.&nbsp; You will learn how these techniques can&nbsp;be used to simplify systems integration so that if one system already defines business logic through lookup tables, you can integrate a new system and share business logic by allowing the new system to write its own business logic based on already existing table-based business logic.</div>\n<div></div>\n<div></div>\n<p>One of the many benefits you will discover is that Roslyn uses an innovative approach to compiler design, opening up the inner workings of the compiler process. You will&nbsp;learn how to see the syntax tree that Roslyn is building as it compiles your code. Additionally,&nbsp;you&nbsp;will learn to&nbsp;feed it your own syntax tree that&nbsp;you create on the fly.</p>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>What You Will Learn:</div>\n<div></div>\n<div>• Structure logic to be stored in database design</div>\n<div>• Build complex conditional logic based on lookup data in the database</div>\n<p>• Compile code that you generate programmatically</p>\n<div>• Discover generated code and run it dynamically to implement new business logic</div>\n<div>• Debug problems in generated code</div>\n<div>• Deploy and access generated code</div>\n</div>\n<div></div>\n<div>Who This Book Is For:</div>\n<div></div>\n<div>Back end developers in very dynamic fast-paced business environments. &nbsp; Developers focused on integrating different systems across an enterprise should also find this information useful.</div>\n</div>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170301/Code%20Generation%20with%20Roslyn.pdf",
    "file_format": "PDF",
    "file_size": "1.6 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/03/Code-Generation-with-Roslyn.jpg",
    "language": "English",
    "name": "Code Generation with Roslyn",
    "pages": "105",
    "read_online": "http://www.allitebooks.com/read/index.php?id=26687",
    "year": "2017"
  },
  "8": {
    "author": "Robert Lair",
    "category": ".NET",
    "code": "1590599527",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>This book takes you on a guided tour of the new tools available to create Silverlight applications, from Expression Design and Expression Blend through to Visual Studio 2008. It explains how each of the tools performs it’s part of the job of putting together well-constructed Silverlight applications and demonstrates this with a series of straight-forward examples that illustrate how developers and designers can perform their roles in harmony. By the end of the book, you will be well prepared to start creating Silverlight applications, both on your own or with the support of a design team.</p>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170204/Beginning%20Silverlight%202.pdf",
    "file_format": "PDF",
    "file_size": "5.5 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/02/Beginning-Silverlight-2.jpg",
    "language": "English",
    "name": "Beginning Silverlight 2",
    "pages": "285",
    "read_online": "http://www.allitebooks.com/read/index.php?id=26388",
    "year": "2008"
  },
  "9": {
    "author": "Ovais Mehboob Ahmed Khan",
    "category": "ASP.NET .NET",
    "code": "1785886460",
    "content": "\n                    <h3>Book Description:</h3>\n\t\t\t\t\t\t<p>If you want to improve responsiveness or the UX in your ASP.NET applications, JavaScript can be a life saver. In an age where server-side operations have shifted to the client, being able to handle JavaScript with confidence and fluency is vital for ASP.NET developers. There’s no point trying to fight it, so start learning with this book. Make sure your projects exceed user expectations.</p>\n<p>Begin by getting stuck into the basics of JavaScript, and explore the language in the context of ASP.NET Core. You’ll then find out how to put the principles into practice, as you learn how to develop a basic ASP.NET application using Angular 2 and TypeScript. You’ll also develop essential skills required to develop responsive apps, with a little help from AJAX, ensuring that you’re building projects that can be easily accessed across different devices.</p>\n<p>With guidance on Node.js and some neat techniques to test and debug a range of JavaScript libraries in Visual Studio, you’ll soon be well on your way to combining JavaScript with ASP.NET in a way that’s capable of meeting the challenges of modern web development head-on.</p>\n<p>What you will learn</p>\n<ul>\n<li>Get to grips with the basic to advanced concepts of JavaScript</li>\n<li>Learn how to use JavaScript on server side using Node.js</li>\n<li>Develop web applications in ASP.NET using JavaScript</li>\n<li>Get to know with industry-wide best practices and design patterns that provide maintainability and scalability</li>\n<li>Build an ASP.NET application using Angular 2 with TypeScript and Web API</li>\n<li>Explore WinJS and see how to use mobile capabilities from web applications</li>\n<li>Use JavaScript to develop scalable ASP.NET applications</li>\n<li>See how to test and debug JavaScript</li>\n</ul>\n\t\t\t\t\t\t\t\t\t\t\t",
    "download_links": "http://file.allitebooks.com/20170125/JavaScript%20for%20.NET%20Developers.pdf",
    "file_format": "PDF",
    "file_size": "6.1 MB",
    "img": "http://www.allitebooks.com/wp-content/uploads/2017/01/JavaScript-for-.NET-Developers-400x493.jpg",
    "language": "English",
    "name": "JavaScript for .NET Developers",
    "pages": "447",
    "read_online": "http://www.allitebooks.com/read/index.php?id=26289",
    "year": "2016"
  }
}